experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60/benchmark.log
[INFO] Log file: /root/autodl-tmp/workspace/experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60/benchmark.log

>>> ============================================
>>> Benchmark RR=1.8 req/s
>>> ============================================
benchmark_args=Namespace(backend='sglang', base_url='http://localhost:8000', host='0.0.0.0', port=None, dataset_name='sharegpt', dataset_path='/root/autodl-tmp/dataset/ShareGPT_V3_unfiltered_cleaned_split.json', model='/root/autodl-tmp/models/Qwen3-30B-A3B', served_model_name=None, tokenizer='/root/autodl-tmp/models/Qwen3-30B-A3B', num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.8, use_trace_timestamps=False, max_concurrency=None, output_file='/root/autodl-tmp/workspace/experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60/rr_1.8/result.json', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url='http://localhost:8000', host='0.0.0.0', port=30000, dataset_name='sharegpt', dataset_path='/root/autodl-tmp/dataset/ShareGPT_V3_unfiltered_cleaned_split.json', model='/root/autodl-tmp/models/Qwen3-30B-A3B', served_model_name=None, tokenizer='/root/autodl-tmp/models/Qwen3-30B-A3B', num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.8, use_trace_timestamps=False, max_concurrency=None, output_file='/root/autodl-tmp/workspace/experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60/rr_1.8/result.json', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 35996
#Output tokens: 23859
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 100/100 [04:25<00:00,  2.65s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    1.8       
Max request concurrency:                 not set   
Successful requests:                     100       
Benchmark duration (s):                  265.09    
Total input tokens:                      35996     
Total input text tokens:                 35996     
Total generated tokens:                  23859     
Total generated tokens (retokenized):    23832     
Request throughput (req/s):              0.38      
Input token throughput (tok/s):          135.79    
Output token throughput (tok/s):         90.00     
Peak output token throughput (tok/s):    264.00    
Peak concurrent requests:                76        
Total token throughput (tok/s):          225.79    
Concurrency:                             26.79     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   71031.40  
Median E2E Latency (ms):                 63817.02  
P90 E2E Latency (ms):                    117977.26 
P99 E2E Latency (ms):                    206362.70 
---------------Time to First Token----------------
Mean TTFT (ms):                          40646.01  
Median TTFT (ms):                        43118.77  
P99 TTFT (ms):                           84429.34  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          129.55    
Median TPOT (ms):                        105.24    
P99 TPOT (ms):                           236.39    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           127.89    
Median ITL (ms):                         102.56    
P95 ITL (ms):                            253.06    
P99 ITL (ms):                            424.33    
Max ITL (ms):                            46167.79  
==================================================
[OK] RR=1.8 done -> /root/autodl-tmp/workspace/experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60/rr_1.8/result.json

>>> ============================================
>>> Generating summary report...
>>> ============================================
  RR= 1.8: throughput=0.38 req/s, TTFT_mean=40646.0ms, TPOT_mean=129.55ms

[OK] Summary saved: /root/autodl-tmp/workspace/experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60/summary.json
[OK] Summary MD saved: /root/autodl-tmp/workspace/experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60/summary.md

============================================
  All Benchmarks Complete!
============================================
  Results:      /root/autodl-tmp/workspace/experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60
  Summary:      /root/autodl-tmp/workspace/experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60/summary.json
  Summary MD:   /root/autodl-tmp/workspace/experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60/summary.md
  Log:          /root/autodl-tmp/workspace/experiment/results/ktransformers/qwen3-30b/20260412_132456_kt_OA_gpu_cache60/benchmark.log
============================================